In [1]:
import pandas as pd

In [6]:
dataset = pd.read_csv("E:\\CODE\\JUPYTER\\datasheet.csv",header=0)
dataset

     Name  Age    Language
0     Raj   20      Python
1   Alice   19        Java
2     Sky   21           C
3   Shawn   25  Javascript
4    Shaw   25  Javascript
5    Shan   26  Javascript
6    Shwn   29  Javascript
7   Shawn  215  Javascript
8    Shwn   25  Javascript
9   Shawn   25  Javascript
10  Shawn   25  Javascript

In [10]:
# Head command - To get spec cols from beginning
dataset = pd.read_csv("E:\\CODE\\JUPYTER\\datasheet.csv",header=0)
dataset.head(5)

    Name  Age    Language
0    Raj   20      Python
1  Alice   19        Java
2    Sky   21           C
3  Shawn   25  Javascript
4   Shaw   25  Javascript

In [11]:
# Tail command - To get spec cols from end
dataset = pd.read_csv("E:\\CODE\\JUPYTER\\datasheet.csv",header=0)
dataset.tail(2)

     Name  Age    Language
9   Shawn   25  Javascript
10  Shawn   25  Javascript

In [12]:
# dtype - datatype handling
dataset = pd.read_csv("E:\\CODE\\JUPYTER\\datasheet.csv",header=0,dtype={"Age":"float64"})
dataset

     Name    Age    Language
0     Raj   20.0      Python
1   Alice   19.0        Java
2     Sky   21.0           C
3   Shawn   25.0  Javascript
4    Shaw   25.0  Javascript
5    Shan   26.0  Javascript
6    Shwn   29.0  Javascript
7   Shawn  215.0  Javascript
8    Shwn   25.0  Javascript
9   Shawn   25.0  Javascript
10  Shawn   25.0  Javascript